---
kind: method
id: M:Autodesk.Revit.DB.ColorWithTransparency.GetTransparency
source: html/2f170ed9-52a0-88a1-f972-f237859ee8bf.htm
---
# Autodesk.Revit.DB.ColorWithTransparency.GetTransparency Method

get transparency

## Syntax (C#)
```csharp
public uint GetTransparency()
```

## Returns
transparency